uhnp/src/Documents/УстановкаКлассовКонтрагентов/УстановкаКлассовКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКлассовКонтрагентов</name>
  <registerRecords>InformationRegister.КлассыКонтрагентов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтрагента</name>
    <type>
      <types>EnumRef.РолиКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньРиска</name>
      <type>
        <types>CatalogRef.СтепениРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньДоходности</name>
      <type>
        <types>CatalogRef.СтепениДоходности</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗадолженностьВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтролироватьЗадолженность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвансаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокОтсрочки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОтсрочкиВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПросроченнойЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПросроченнойЗадолженностиВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/УстановкаКлассовКонтрагентов/Forms/ФормаЗаполненияПоСохраненнымЗапросам/Module.bsl
// Серверная обертка команды ВыполнитьСохраненныйЗапрос.
&НаСервере
Процедура ВыполнитьСохраненныйЗапрос_Сервер()
	Если ЗначениеЗаполнено(СохраненныйЗапрос) Тогда
		// Получим таблицу из сохраненного запроса.
		ТаблицаРезультатЗапрос = УправлениеОбязательствамиУХ.ПолучитьТаблицуКонтрагентовПоСохраненномуЗапросу(СохраненныйЗапрос, ДатаНачала, ДатаОкончания);
		// Проверим её на корректность.
		Если ТипЗнч(ТаблицаРезультатЗапрос) = Тип("ТаблицаЗначений") Тогда
			НайденнаяКолонкаКонтрагент = ТаблицаРезультатЗапрос.Колонки.Найти("Контрагент");
			ЕстьКонтрагент = (НайденнаяКолонкаКонтрагент <> Неопределено);
			Если ЕстьКонтрагент Тогда
				// Проверки пройдены. Заполним табличную часть.
				ТаблицаЗаполнения.Очистить();
				Для Каждого ТекТаблицаРезультатЗапрос Из ТаблицаРезультатЗапрос Цикл
					НоваяСтрока = ТаблицаЗаполнения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекТаблицаРезультатЗапрос);
					НоваяСтрока.Использование = Истина;
				КонецЦикла;
			Иначе
				ТекстСообщения = НСтр("ru = 'В таблице не найдено необходимое поле Контрагент. Операция отменена.'");
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				Возврат;
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Неизвестный вариант результата сохранённого запроса: %ТаблицаРезультатЗапроса%. Операция отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаРезультатЗапроса%", Строка(ТаблицаРезультатЗапрос));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Возврат;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Необходимо заполнить поле Сохраненный запрос'"));
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСохраненныйЗапросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	МожноПродолжать = (РезультатВопроса = КодВозвратаДиалога.Да);
	Если МожноПродолжать Тогда
		ВыполнитьСохраненныйЗапрос_Сервер();
	Иначе
		// Пользователь отказался. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсехЗначимостьЗавершение(ПараметрКоманды, ПараметрВыполненияКоманды) Экспорт
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Для Каждого ТекТаблицаЗаполнения Из ТаблицаЗаполнения Цикл
			ТекТаблицаЗаполнения.СтепеньДоходности = ПараметрКоманды;
		КонецЦикла;
	Иначе
		// Значение не выбрано. Не проставляем Значимость.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсехКлассПлатежнойДисциплиныЗавершение(ПараметрКоманды, ПараметрВыполненияКоманды) Экспорт
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Для Каждого ТекТаблицаЗаполнения Из ТаблицаЗаполнения Цикл
			ТекТаблицаЗаполнения.СтепеньРиска = ПараметрКоманды;
		КонецЦикла;
	Иначе
		// Значение не выбрано. Не проставляем Класс платежной дисциплины.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСохраненныйЗапрос(Команда)
	Если ТаблицаЗаполнения.Количество() > 0 Тогда
		ОповещениеВопроса = Новый ОписаниеОповещения("ВыполнитьСохраненныйЗапросЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'В табличной части уже присутствуют данные. Продолжить?'");
		ПоказатьВопрос(ОповещениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьСохраненныйЗапрос_Сервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполнение параметров Дата начала и Дата окончания.
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ДатаНачала = НачалоГода(ТекущаяДатаСеанса);
	ДатаОкончания = КонецГода(ТекущаяДатаСеанса);
	// Заполнение параметра Очищать данные документа.
	ОчищатьДанныеДокумента = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для Каждого ТекТаблицаЗаполнения Из ТаблицаЗаполнения Цикл
		ТекТаблицаЗаполнения.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьНичего(Команда)
	Для Каждого ТекТаблицаЗаполнения Из ТаблицаЗаполнения Цикл
		ТекТаблицаЗаполнения.Использование = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДанные(Команда)
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ОчищатьДанныеДокумента", ОчищатьДанныеДокумента);
	МассивЗаполнения = Новый Массив;
	Для Каждого ТекТаблицаЗаполнения Из ТаблицаЗаполнения Цикл
		Если ТекТаблицаЗаполнения.Использование Тогда
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Контрагент",					 ТекТаблицаЗаполнения.Контрагент);
			СтруктураСтроки.Вставить("СтепеньДоходности",				 ТекТаблицаЗаполнения.СтепеньДоходности);
			СтруктураСтроки.Вставить("СтепеньРиска",	 ТекТаблицаЗаполнения.СтепеньРиска);
			МассивЗаполнения.Добавить(СтруктураСтроки);
		Иначе
			Продолжить;				//Не нужно переносить эту строку
		КонецЕсли;
	КонецЦикла;
	СтруктураОповещения.Вставить("МассивЗаполнения", МассивЗаполнения);
	Оповестить("ПеренестиКонтрагентовПоСохраненномуЗапросу", СтруктураОповещения, ЭтаФорма);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсехЗначимость(Команда)
	Если ТаблицаЗаполнения.Количество() > 0 Тогда
		ОписаниеОповещенияФормыВыбора = Новый ОписаниеОповещения("УстановитьДляВсехЗначимостьЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.СтепениДоходности.ФормаВыбора", , , , , , ОписаниеОповещенияФормыВыбора);
	Иначе
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Таблица контрагентов пуста. Установка значений невозможна.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсехКлассПлатежнойДисциплины(Команда)
	Если ТаблицаЗаполнения.Количество() > 0 Тогда
		ОписаниеОповещенияФормыВыбора = Новый ОписаниеОповещения("УстановитьДляВсехКлассПлатежнойДисциплиныЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.СтепениРиска.ФормаВыбора", , , , , , ОписаниеОповещенияФормыВыбора);
	Иначе
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Таблица контрагентов пуста. Установка значений невозможна.'"));
	КонецЕсли;
КонецПроцедуры
